test/fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "LOCATION_PLACEHOLDER";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     //#includeEtc "caseDicts/setConstraintTypes"

	".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

	/*
    OUTLET_01
    {
        type            zeroGradient;
    }

    OUTLET_02
    {
        type            zeroGradient;
    }
	*/

	".*_to_.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
