test/fluid/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "LOCATION_PLACEHOLDER";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
     //#includeEtc "caseDicts/setConstraintTypes"

	".*"
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

	/*
    OUTLET_01
    {
        type            calculated;
        value           $internalField;
    }

    OUTLET_02
    {
        type            calculated;
        value           $internalField;
    }
	*/

	".*_to_.*"
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}

// ************************************************************************* //
