test/fluid/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "LOCATION_PLACEHOLDER";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{
     //#includeEtc "caseDicts/setConstraintTypes"

	".*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

	/*
    OUTLET_01
    {
        type            inletOutlet;
        inletValue      uniform 0.0377336;
        value           uniform 0.0377336;
    }

    OUTLET_02
    {
        type            inletOutlet;
        inletValue      uniform 0.0377336;
        value           uniform 0.0377336;
    }
	*/

	".*_to_.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
