test/fluid/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "LOCATION_PLACEHOLDER";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"

	".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

	/*
    OUTLET_01
    {
        type            inletOutlet;
        inletValue      uniform 0.00375;
        value           uniform 0.00375;
    }

    OUTLET_02
    {
        type            inletOutlet;
        inletValue      uniform 0.00375;
        value           uniform 0.00375;
    }
	*/

	".*_to_.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
