test/fluid/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "LOCATION_PLACEHOLDER";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     //#includeEtc "caseDicts/setConstraintTypes"

	".*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

	/*
    OUTLET_01
    {
        type            calculated;
        value           $internalField;
    }

    OUTLET_02
    {
        type            calculated;
        value           $internalField;
    }
	*/

    ".*_to_.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
