test/fluid/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "LOCATION_PLACEHOLDER";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
     //#includeEtc "caseDicts/setConstraintTypes"


    ".*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

	/*
    OUTLET_01
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET_02
    {
        type            fixedValue;
        value           $internalField;
    }
	*/

    ".*_to_.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

}

// ************************************************************************* //
